import React from 'react';
import { Navbar } from '../../components/Navbar';
import { Carousel } from '../../shared/components/Carousel';

const FrontPage: React.FC = () => {
    const items = [
        {
            id: 0,
            title: "Голибони озмуни фанни информатика",
            titleDetails: "Санаи 12.09.2020 озмун аз фанни информатика баргузор гардид, ки голибони озмун бо чойхои намоен ва тухфахо сазовор гардиданд."
        },
        {
            id: 1,
            title: "Голибони озмуни фанни информатика",
            titleDetails: "Санаи 12.09.2020 озмун аз фанни информатика баргузор гардид, ки голибони озмун бо чойхои намоен ва тухфахо сазовор гардиданд."
        },
        {
            id: 2,
            title: "Голибони озмуни фанни информатика",
            titleDetails: "Санаи 12.09.2020 озмун аз фанни информатика баргузор гардид, ки голибони озмун бо чойхои намоен ва тухфахо сазовор гардиданд."
        },
        {
            id: 3,
            title: "Голибони озмуни фанни информатика",
            titleDetails: "Санаи 12.09.2020 озмун аз фанни информатика баргузор гардид, ки голибони озмун бо чойхои намоен ва тухфахо сазовор гардиданд."
        },
        {
            id: 4,
            title: "Голибони озмуни фанни информатика",
            titleDetails: "Санаи 12.09.2020 озмун аз фанни информатика баргузор гардид, ки голибони озмун бо чойхои намоен ва тухфахо сазовор гардиданд."
        }
    ];
    return (
        <>
            <Navbar />
            <Carousel items={items} />
        </>
    )
}

export default FrontPage
